/*
В една Бананова република има много хълмове, свързани с мостове.
В химическия завод станала авария, в резултат на което се изпарил 
експериментален препарат. На следващия ден завалял цветен дъжд, при
това той валял само над хълмовете. Над някои места падали червени капки, над някои -  сини, а над останалите - зелени,
в резултат на което хълмовете се оцветили в съответния цвят. На президента на Банановата република това много му харесало,
но му се приискало да боядиса и мостовете между хълмовете така, че мостовете да бъдат оцветени в цвета на хълмовете, които свързват.
За съжаление, ако хълмовете са с различни цветове, то не може да се боядиса моста по този начин. Пресметнете броя на "лошите"
мостове, като напишете за целта програма BRIDGE.
*/

// !! Трябва да се довърши | Статус: Незввършена !!

#include <iostream>
#include <vector>

using namespace std;

int const red = 1;
int const blue = 2;
int const green = 3;

int graph[16][16]; //ãðàô

int findBadBridges(int N)
{
	cout << endl << endl << endl;
	for (int i = 0; i < N; i++)
	{
		for (int j = i + 1; j < N; j++)
		{
			if (graph[i][j] == 1)
			{
				cout << graph[i][j] << " || " << i << " " << j << endl;
			}
		}
	}
}

int main()
{
	int N; //áðîé íà õúëìîâåòå
	cin >> N;
	for (int i = 0; i <= N; i++)
	{
		for (int j = 0; j < N; j++)
		{
			cin >> graph[i][j];
		}
	}

	cout << findBadBridges(N);
	return 0;
}
