/*
В една Бананова република има много хълмове, свързани с мостове.
В химическия завод станала авария, в резултат на което се изпарил 
експериментален препарат. На следващия день завалял цветен дъжд, при
това той валял само над хълмовете. Над някои места падали червени капки, над някои -  сини, а над останалите - зелени,
в резултат на което хълмовете се оцветили в съответния цвят. На президента на Банановата република това много му харесало,
но му се приискало да боядиса и мостовете между хълмовете така, че мостовете да бъдат оцветени в цвета на хълмовете, които свързват.
За съжаление, ако хълмовете са с различни цветове, то не може да се боядиса моста по този начин. Пресметнете броя на "лошите"
мостове, като напишете за целта програма BRIDGE.
*/

